Tekla.Structures.Drawing.ModelObject
The ModelObject class is an abstract class for all model objects in the drawing side.
The model objects of the drawing side contain identifiers of the actual model objects in the model database.
The model objects appear and disappear based on current view properties (view size, settings).

Tekla.Structures.Drawing.ModelObject.ModelIdentifier
The database identifier of the model object in the model database.
By using this identifier, it is possible to select the actual object
in the Tekla Structures model.

Tekla.Structures.Drawing.ModelObject.Hideable
Accesses the information if this object is hidden or not or if it should be.